from pathlib import Path

DATA_DIR = Path("data")
METADATA_PATH = Path("metadata.json")
TYPES_WHITELIST = {"int": int, "bool": bool, "str": str}

CMD_WHITELIST = {
    "exit" : "выйти из программы",
    "help": "справочная информация",
    "create_table": "<имя_таблицы> <столбец1:тип> <столбец2:тип> .. - создать таблицу",
    "list_tables": "показать список всех таблиц",
    "drop_table": "<имя_таблицы> - удалить таблицу",
    "select": (
        'from <имя_таблицы> - прочитать все записи '
        '[where <столбец> = <значение>] - прочитать записи по условию.'
    ),
    "insert": (
        'into <имя_таблицы> values (<значение1>, <значение2>, ...) - '
        'создать запись'
    ),
    "update": (
        '<имя_таблицы> set <столбец> = <значение> '
        'where <столбец_условия> = <значение_условия> - обновить запись'
    ),
    "delete": (
        'from <имя_таблицы> where <столбец_условия> = <значение_условия> '
        '- удалить запись'
    ),
    "info": "<имя_таблицы> - показать информацию о таблице"
}
